INSERT INTO Subject(name) VALUES
('История'),
('Физика'),
('БД'),
('Практика'),
('Английский'),
('DevOps'),
('ВВИТ'),
('Высшая математика'),
('Физра');


INSERT INTO Timetable(day, name_subject, room_numb, start_time) VALUES
--Первая неделя
(1, 'Физра', 'Зал', 1),
(1, 'Английский', 'Н-322', 2),
(2, 'Английский', 'Н-405', 1),
(2, 'Физика', 'Н-322а', 2),
(2, 'История', 'Н-404', 3),
(3, 'Высшая математика', 'Н-324', 2),
(3, 'Высшая математика', 'Н-514', 3),
(3, 'Физика', 'Н-226', 4),
(4, 'ВВИТ', 'А-Л-203', 1),
(4, 'DevOps', 'А-Л-206', 2),
(5, 'История', 'Н-227', 1),
(5, 'БД', 'Н-535', 2),
(5, 'Физра', 'Зал', 3),
(5, 'БД', 'Н-410', 4),
--Вторая неделя
(8, 'Высшая математика', 'Н-514', 2),
(8, 'История', 'Н-316', 3),
(8, 'Физика', 'Н-340', 4),
(8, 'БД', 'Н-519', 5),
(10, 'Практика', 'А-Л-208', 2),
(10, 'DevOps', 'А-ВЦ-302', 3),
(10, 'DevOps', 'А-414', 4),
(11, 'ВВИТ', 'А-Л-205', 1),
(11, 'ВВИТ', 'А-Л-205', 2),
(12, 'Высшая математика', 'Н-330а', 1),
(12, 'Физра', 'Зал', 2);


INSERT INTO Teacher(full_name, name_subject) VALUES
('Шаймарданова Л.К.','Высшая математика'),
('Городничев М.Г.','DevOps'),
('Волохова С.В.','Физра'),
('Скляр Л.Н.','История'),
('Полищук Ю.В.','БД'),
('Воронова Е.В.','Английский'),
('Вальковский С.Н.','Физика'),
('Фурлетов Ю.М.','ВВИТ'),
('Потапченко Т.Д.','Практика');


